{"id":1628,"date":"2020-05-13T10:23:47","date_gmt":"2020-05-13T10:23:47","guid":{"rendered":"https:\/\/archive.trenchperspective.com\/?p=1628"},"modified":"2020-09-09T05:20:14","modified_gmt":"2020-09-09T05:20:14","slug":"tete-a-tete-roshith","status":"publish","type":"post","link":"https:\/\/stark.in\/2020\/05\/13\/tete-a-tete-roshith\/","title":{"rendered":"Tete-a-tete: Roshith"},"content":{"rendered":"\n<h5>Roshith, our accounts director, lets us into his quiet world outside of work where he is a master collector of automobile magazines and fountain pens.<\/h5>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><strong>1) You have a wide collection of pens and automobile magazines. When did this fascination begin? Who or what inspired you to begin?<\/strong><\/p>\n\n\n\n<p>Well, pens are a more recent hobby I would say. From my schooling days, I have always had a fascination with fountain pens. I believe ball pens are characterless and move just your fingers to write while fountain pens are hot-wired to your brain and though they aren’t as seamless or smooth as ball pens, you tend to think and form whatever you are planning to write. They teach me stuff – about precision, craftsmanship, passion, dedication, knowledge and creation. They are very high maintenance – they need to be cleaned and stored properly when in use (I have a custom wooden pen case that can store close to a 1000 pens), sometimes they get clogged, leak all over the place and are downright temperamental – meaning they just refuse to write. And the only reward you get for all your troubles is permanent ink spots usually on the tip of your right fingers. I am not making this up, but my colleague and our creative department honcho – Shelton, is the one who inspired me to start a pen collection on my own. I had been dabbling with fountain pens before that, but those were largely functional. After a client pitch, the entire team met up to have lunch at a restaurant. It was then that I noticed Shelton had a knapsack pocket full of pens. I heard of names like the Sailor, never before seen variants of the ubiquitous Hero and I still remember a pen with a see-through body filled with the most beautiful fluidic red ink that sloshed around inside the chamber ( I now own three of them). I was instantly hooked.<\/p>\n\n\n\n<p><strong>2) Have you ever gone out of your way to collect a particular pen?<\/strong><\/p>\n\n\n\n<p>Since I use my pens regularly (whenever possible, I avoid clacking around on the keyboard), I don’t have too many expensive or luxury pen brands. Most of them are hardworking pens and usually rare Indian handmade pens. So when I chanced upon a beaten down pen in a shop selling antique stuff in Trivandrum, I bought it, though it was not in working condition. The antique shop guy was also not clearly someone who knew his pens and I got it for around 1000 bucks or so. I then took it to my trusted pen doctor Palani (now deceased) who examined it closely through a convex lens and announced that it was a rare Parker from the late 60’s. It was then reconditioned back to its original glory with an original nib I sourced from Chennai and it is now the pride of place in my collection.<\/p>\n\n\n\n<p><strong>3) Which is the most expensive and the most special pen you own?<\/strong><\/p>\n\n\n\n<p>That would be a pure-bred Indian Ratnamson pen with a gold tip. The family have been in the pen-making business for generations and the shop in Hyderabad which makes custom handmade pens is rumoured to be India’s first Swadeshi pen maker and had among its customers, the Father of the Nation.<\/p>\n\n\n\n<p><strong>4) How many types of pens do you own?<\/strong><\/p>\n\n\n\n<p>I don’t qualify to be a full-blown pen collector. I would have close to 50 pens in my collection, but it is growing.<\/p>\n\n\n\n<p><strong>5) Have you noticed any big changes in pen collecting since you’ve started?<\/strong><\/p>\n\n\n\n<p>When I started, fountain pens were dying a slow death. The convenience of sleek ball and gel pens had taken its toll. Nobody wanted to be stuck with a cumbersome fountain pen. The scene is different now though. Discarded ball pens are now seen as a growing environmental threat so much so that many schools have banned them. They are also advocated in many schools as they claim to improve handwriting if used from a very early age – of course, I might be an exception to this rule – it’s said I have the most illegible handwriting and am often the butt of my colleagues’ jokes. The younger generation is also suddenly finding it cool to be sporting a fountain\/ink pen.<\/p>\n\n\n\n<p><strong>6) You are known for your love for automobiles. If you were not working for Stark, what would you be and why?<\/strong><\/p>\n\n\n\n<p>Well, automobiles are everything to me. Be it two or four wheels – nothing moves me like a motorised contraption. I am very weak with numbers. I am sure if I had a little more standing with science, I would’ve loved to be associated with an automobile major. Nothing stirs the soul as seeing an automobile take birth.<\/p>\n\n\n\n<p><strong>7) Why do you think automobile magazines can still be valuable? How many magazines do you own?<\/strong><\/p>\n\n\n\n<p>Automobile magazines, especially for someone who loves automobiles, is preserving a slice of history. I started collecting auto magazines almost 30 years back. It’s a fascinating journey to see how automobiles have evolved and being in advertising even the grainy b\/w ads of Ambassadors of yore are a treat for sore eyes. I have close to 4000 magazines including the first editions of all auto magazines launched in India. I also have a collection numbering a few hundreds of international magazines across niche automobile categories like trucks and even yachts. The oldest magazine I have in my collection is from 1983 and it cost me a princely sum of 7 rupees back then. I am also connected to most of the scrap paper merchants and they let me know whenever they happen to get old mags. In fact for the first time ever, I have finished cataloguing my collection during the lockdown period and am in the process of applying to the Limca Book of Records. Fingers crossed.<\/p>\n\n\n\n<p><strong>8) What is it about these collections that appeal to you?<\/strong><\/p>\n\n\n\n<p>Like I said earlier, automobiles are harbingers to how a society moved on and evolved. Nothing documents it more perfectly than these magazines. Also from an enthusiast’s point of view, it’s a great thrill to read and know more about performance and other parameters of automobiles. Exotic machines like Lamborginis, Ferraris, R1 sports bikes – are all yours to savour even though they are only on paper.<\/p>\n\n\n\n<p><strong>9) What is the most recent addition to both your collections?<\/strong><\/p>\n\n\n\n<p>It’s an ongoing process, as I buy most of the auto magazines available in India and some international editions too, from friends who travel abroad. As for pens, I like collecting handmade Indian ones. The most recent was from the Chennai based Gem Pens. The Gem Gama actually has two heads, which essentially means it comes with two nibs and you can fill ink on both the sides.<\/p>\n\n\n\n<p><strong>10) Why do you prefer print over digital? In this digital era, do you think there will still be collectors like you?<\/strong><\/p>\n\n\n\n<p>I think archiving print versions is better rewarding than looking at bland reproduction in a screen. Yes, as we increasingly get into digital formats, I think there would be collectors out there who would love to collect and thump through old and difficult-to- find magazines .<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Roshith, our accounts director, lets us into his quiet world outside of work where he is a master collector of automobile magazines and fountain pens.<\/p>\n","protected":false},"author":1,"featured_media":1682,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/posts\/1628"}],"collection":[{"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/comments?post=1628"}],"version-history":[{"count":1,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/posts\/1628\/revisions"}],"predecessor-version":[{"id":2619,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/posts\/1628\/revisions\/2619"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/media\/1682"}],"wp:attachment":[{"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/media?parent=1628"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/categories?post=1628"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/stark.in\/wp-json\/wp\/v2\/tags?post=1628"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}