{"id":32,"date":"2020-02-26T08:55:01","date_gmt":"2020-02-26T08:55:01","guid":{"rendered":"http:\/\/localhost\/xampp\/stark\/?page_id=32"},"modified":"2020-10-22T10:17:05","modified_gmt":"2020-10-22T10:17:05","slug":"about","status":"publish","type":"page","link":"https:\/\/radarstech.com\/about\/","title":{"rendered":"The curious case of being Stark"},"content":{"rendered":"\n<h2>The&nbsp;Start<\/h2>\n\n\n\n<p>Led by TK Harshan, Swarup BR and Roy V Mathew, a little team set out on an exciting journey from the city of Trivandrum in 1994. With no office or equipment, they started around a dining table, and in a short while, began to be known for their hands-on approach, trustworthiness and refreshingly effective ideas. In fact, this team would set the tone for Stark’s work over the years.<\/p>\n\n\n\n<h2>Inherently Indie<\/h2>\n\n\n\n<p>The way in which Stark has worked over the last two decades is what could perhaps be described as an &#8216;indie&#8217; approach. At the heart of it, this is about being proudly local and working with a close community of passionate people independent of larger allegiances– people who desire to create meaningful work that expands boundaries–while being truthful to themselves and their clients.<\/p>\n\n\n\n<h2>Seeing the&nbsp;Big&nbsp;Picture<\/h2>\n\n\n\n<p>Stark firmly believes that brands need a cohesive and comprehensive communication strategy in these times of extensive fragmentation. Thus emerged its spectrum of services ranging from Strategic Planning, Business Consulting, Advertising, Design and&nbsp;Digital to Branded Content. Its impressive client retention record &#8211; including some relationships that span over two decades &#8211; is proof for the success of this approach.<\/p>\n\n\n\n<h2>Letting the&nbsp;Work&nbsp;Speak<\/h2>\n\n\n\n<p>Characteristically, Stark has always stayed under the radar while creating highly visible campaigns for its brands. In over 27 years, the agency has evolved a trademark local-global synergy that helps it to create strikingly authentic brand ideas. Some of India’s most renowned brands and memorable campaigns testify to this.<\/p>\n\n\n\n<h2>A&nbsp;Widening Arc<\/h2>\n\n\n\n<p>Today, Stark is present in Trivandrum, Kochi, Bengaluru, Hyderabad and New Delhi in India and consistently wins awards for its work involving a host of brands across travel, media, healthcare, technology, IT,&nbsp;retail, FMCG, aviation,&nbsp;real&nbsp;estate,&nbsp;banking,&nbsp;sports,&nbsp;education and&nbsp;infrastructure – both in the public and private sector.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The&nbsp;Start Led by TK Harshan, Swarup BR and Roy V Mathew, a little team set out on an exciting journey from the city of Trivandrum in 1994. With no office or equipment, they started around a dining table, and in a short while, began to be known for their hands-on approach, trustworthiness and refreshingly effective [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-about.php","meta":[],"_links":{"self":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/32"}],"collection":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/comments?post=32"}],"version-history":[{"count":21,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/32\/revisions"}],"predecessor-version":[{"id":2726,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/32\/revisions\/2726"}],"wp:attachment":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/media?parent=32"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}