{"id":45,"date":"2020-02-26T09:59:14","date_gmt":"2020-02-26T09:59:14","guid":{"rendered":"http:\/\/localhost\/xampp\/stark\/?page_id=45"},"modified":"2020-09-10T13:00:27","modified_gmt":"2020-09-10T13:00:27","slug":"human-by-nature","status":"publish","type":"page","link":"https:\/\/radarstech.com\/work\/human-by-nature\/","title":{"rendered":"Human by Nature"},"content":{"rendered":"\n<h2>Human by Nature<\/h2>\n\n\n\n<h5>Kerala, one of India’s most sought after destinations has always drawn travellers with its greenery, backwaters and scenic landscapes. Yet over the past few years, an interesting shift in perception was noticed. More and more, ‘people’, ‘human’ and ‘culture’ were becoming significant keywords that the international traveller used for describing the Kerala experience. <\/h5>\n\n\n<p>This insight was especially valid to Kerala which was known for its unique way of life that embodied inclusiveness, harmony and its historic openness to traders and visitors from around the world for the last 3000 years. Looking at these possibilities, we realised that this was an opportunity to go beyond just a marketing campaign. It was an opportunity to present the Kerala way of life to the world, as a possibility to live with differences and connect seamlessly with each other as humans. An exploration of our nature as Humans. To go beyond the landscape and explore the Human scape. Thus emerged ‘Human By Nature.<\/p>\n\n\n<h5>Film<\/h5>\n\n\n\n<p>The film, shot with a cast of local people, is a seamless tapestry of micro-narratives that play out across five distinct terrains. They unveil human relationships and their interconnectedness with nature. Both in tone, treatment and cinematography, the film is kept as real and nuanced, as far away as possible from the slickness of commercials and as close as possible to the authentic everyday lives of the people in each terrain. The Music, created specifically for the commercial, did involve elements of Kerala, but stayed away from the cliched ethnic tropes, keeping it nuanced and relevant.<\/p>\n\n\n\n<iframe src=\"https:\/\/www.youtube-nocookie.com\/embed\/gsngTPN-It4?rel=0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"1080\" height=\"640\" frameborder=\"0\"><\/iframe>\n\n\n\n<h5>Print<\/h5>\n\n\n\n<p>The campaign was shot by the renowned New York based photographer Joey L, who was chosen for his work that straddles the worlds of photojournalism and commercial photography. Keeping the tone and the treatment real, the images were made across the five diverse terrains of Kerala &#8211; the backwaters, the forest, the village, the streets and the seashore. The people and travellers were painstakingly selected from the terrains they live in.<\/p>\n\n\n\n<p>By juxtaposing the unique terrains and the people, the campaign opens up powerful and diverse human experiences that are relevant to today’s travellers and our world. The travellers in the campaign are tucked away in the backdrop, woven into the multi-layered tapestry of everyday life &#8211; not as outsiders, but as insiders who are perfectly at home with the land and its culture.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Human by Nature Kerala, one of India’s most sought after destinations has always drawn travellers with its greenery, backwaters and scenic landscapes. Yet over the past few years, an interesting shift in perception was noticed. More and more, ‘people’, ‘human’ and ‘culture’ were becoming significant keywords that the international traveller used for describing the Kerala [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":1215,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-work-details.php","meta":[],"_links":{"self":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/45"}],"collection":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/comments?post=45"}],"version-history":[{"count":7,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/45\/revisions"}],"predecessor-version":[{"id":2687,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/45\/revisions\/2687"}],"up":[{"embeddable":true,"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/pages\/1215"}],"wp:attachment":[{"href":"https:\/\/radarstech.com\/wp-json\/wp\/v2\/media?parent=45"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}